def task1(a, b):    
    d = ["первое","второе","третье","четвертое",
         "пятое","шестое","седьмое","восьмое",
         "девятое","десятое","одинадцатое",
         "двенадцатое","тринадцатое","четырнадцатое",
         "пятнадцатое","шестанадцатое","семнадцатое",
         "восемнадцатое","девятнадцатое","двадцатое",
         "двадцать первое","двадцать второе","двадцать третье",
         "двадцать четвертое","двадцать пятое","двадцать шестое",
         "двадцать седьмое","двадцать восьмое","двадцать девятое",
         "тридцатое","тридцать первое"]
    m = ["января","февраля","марта","апреля",
         "мая","июня","июля","августа","сентября",
         "октября","ноября","декабря"]
    print(f"{d[a-1]} {m[b-1]}")
def task2(c, n):
    d = {'С':['В','С','З'],
         'З':['С','З','Ю'],
         'Ю':['З','Ю','В'],
         'В':['Ю','В','С']}
    print(d[c][n+1])
    
def task3(n):
    if n//10 == 1:
        d ={10:"десять учебных заданий",
            11: "одинадцать учебных заданий",
            12: "двенадцать учебных заданий",
            13: "тринадцать учебных заданий",
            14: "четырнадцать учебных заданий",
            15: "пятнадцать учебных заданий",
            16: "шестнадцать учебных заданий",
            17: "семнадцать учебных заданий",
            18: "восемнадцать учебных заданий",
            19: "девятнадцать учебных заданий"}
        print(d[n])
    else:
        s = ""
        d1 = {2:"двадцать ",
              3:"тридцать ",
              4:"сорок "}
        s += d1[n//10]
        
        m = n%10
        d2 ={1:"одно ",
             2:"два ",
             3:"три ",
             4:"четыре ",
             5:"пять ",
             6:"шесть ",
             7:"семь ",
             8:"восемь ",
             9:"девять "}
        s += d2[m]
        if m == 1:
            s+="учебное задание"
        elif m==2 or m==3 or m==4:
            s+="учебных задания"
        else:
            s+="учебных заданий"
        print(s)
    
def task4(n):
    s = ""
    d1= {  1:"сто ",
           2:"двести ",
           3:"триста ",
           4:"четыреста ",
           5:"пятьсот ",
           6:"шестьсот ",
           7:"семьсот ",
           8:"восемьсот ",
           9:"девятьсот "}
    s+=d1[n//100]
    
    if (n%100)//10==1:
        d2={ 10:"десять",
             11:"одинадцать",
             12:"двенадцать",
             13:"тринадцать",
             14:"четырнадцать",
             15:"пятнадцать",
             16:"шестнадцать",
             17:"семнадцать",
             18:"восемнадцать",
             19:"девятнадцать"}
        s+=d2[n%100]
    else:
        d2={ 2:"двадцать ",
             3:"тридцать ",
             4:"сорок ",
             5:"пятьдесят ",
             6:"шестьдесят ",
             7:"семьдесят ",
             8:"восемьдесят ",
             9:"девяносто "}
        s+=d2[(n%100)//10]
        d3={ 1:"один",
             2:"два",
             3:"три",
             4:"четыре",
             5:"пять",
             6:"шесть",
             7:"семь",
             8:"восемь",
             9:"девять"}
        s+=d3[n%10]
    print(s)
    
def task5(n):
    n1 = (n-1984) % 12
    n2 = (n-1984)%10//2
    s="год "
    d1 = { 0:{True:"зеленого ", False:"зеленой "},
           1:{True:"красного ", False:"красной "},
           2:{True:"желтого ", False:"желтой "},
           3:{True:"белого ", False:"белой "},
           4:{True:"черного ", False:"черной "}}
    s += d1[n2][n1 in [2,3,4]]
    d2 = { 0:"крысы",
           1:"коровы",
           2:"тигра",
           3:"зайца",
           4:"дракона",
           5:"змеи",
           6:"лошади",
           7:"овцы",
           8:"обезьяны",
           9:"курицы",
           10:"собаки",
           11:"свиньи"}
    s += d2[n1]
    print(s)

def printTask(n):
    print(f"Task {n}:")
    
printTask(1)
task1(20, 4)
printTask(2)
task2('С', -1)
printTask(3)
task3(28)
printTask(4)
task4(814)
printTask(5)
task5(2022)